# *Beginner level*

# 1. Виведіть повідомлення `Hello, Python!` 
# на екран n разів (`n` - ціле число, яке вводить користувач).

n = int(input("Введіть кількість повідомлень"))
i = 0
while i < n:
    print("Hello,Python!")
    i += 1

# 2. Дано два цілих числа `a` і `b` (a ≤ b).
#  Виведіть всі числа від `a` до `b` включно.

a = int(input("Введіть перше число"))
b = int(input("Введіть друге число"))

if a <= b:
    while a <= b:
        print(a)
        a += 1
else:
    print("Enter first letter smaller than second")         

# 3. Напишіть програму-таймер зворотного відліку, яка запитує у користувача кількість секунд n, з якої слід починати відлік.

finish = int(input("Введіть старт для зворотнього відліку"))
while finish > 0:
    print(finish)
    finish -= 1
print("Start!")

# 4.Користувач вводить кількість навчальних предметів n, а потім, відповідно, оцінки учня з n навчальних предметів. Визначте середню оцінку.

quantity = int(input("Введіть кількість предметів"))
i = 1
sum = 0
while i <= quantity:
    note = int(input(f"Введіть оцінку з предмету № {i}"))
    i += 1
    sum += note
print("Середня оцінка", sum / quantity)

# 5. Надрукувати у рядку `m` разів число `n`. Числа `m` і `n` - цілі числа, які вводить користувач у порядку `n`, `m`.

n = int(input("Введіть число"))
m = int(input("Введіть кількість повторень"))

for i in range(m):
    print(n, end = " ")

# 6. Напишіть програму для друку цілих чисел від `n` до 0 із виведенням біля кожного числа кількості символів `#`, що дорівнює значенню числа.

n = int(input("Введіть число"))
while n != 0:
    print(n, "#" * n)
    n -= 1

# 7. Напишіть програму для побудови шаблону як у вихідних даних за введеним значенням `n`.

n = int(input("Введіть число"))
i = 1
#Варіант1
for i in range(n + 1):
    print(str(i) * i)
    i += 1
#Варіант2
while i <= n:
    print(str(i) * i)
    i += 1

# *Middle level*
# 8. Намалювати сходинки як у вихідних даних, використовуючи символи пропуску і решітки `#`, коли на вхід програми подається ціле число `n` - кількість сходинок.

n = int(input("Введіть кількість сходинок"))

for i in range(n + 1):
    print("#" * i)
    i += 1

# 9. За даним цілим додатнім числом `n` обчисліть `n!` - значення факторіалу цього числа.

n = int(input("Введіть число"))
factorial = 1
for i in range(1,n+1):
    factorial *= i
print(factorial)

# 10. Автогонщик в перший день ралі проїхав `d` км. Кожен наступний день він збільшував пробіг на 10% від пробігу попереднього дня. Через скільки днів автоспортивних змагань сумарний пробіг автомобіля за всі дні перевищить `t` км і яке значення сумарного пробігу? Введення даних користувачем відбувається в порядку: `d`, `t`.

d = int(input("Введіть кількість кілометрів за день"))
t = int(input("Введіть потрібну кількість кілометрів"))
days = 1
quantity = d
while quantity <= t:
  d += d*0.1
  quantity += d
  days += 1
print(quantity,days)

# 11. Дано ціле число `n`. З чисел 1, 4, 9, 16, 25, …​ надрукувати ті, які не перевищують `n`. *(зверніть увагу на задану послідовність)*




# 12. Дано цілі числа `a` і `b`. Обчислити a ^ b (a в степені b), не використовуючи операцію піднесення до степеня.

a = int(input("Введіть число"))
b = int(input("Введіть ступінь"))
result = 1
for i in range(b):
  result *= a 

# *Hard level*

# 13. Дано натуральне число `n`. Визначити, чи є воно автоморфним числом.  
# *Примітка: Автоморфне число - число, квадрат якого рівний останнім розрядами квадрата цього числа: 5 - 25, 6 - 36, 25 - 625.*

n = int(input("Введіть число"))
print(str(n ** 2)[-(len(str(n))):] == str(n))
  
# 14. Дано натуральне число n. Надрукуйте всі n-значні непарні натуральні числа в порядку спадання.

n = int(input("Введіть число"))
num = int("1" + "0"*n)
for i in range(num, 0, -1):
   if (i % 2) != 0:
       print(i, end = " ")

# 15. Написати програму для обчислення суми цифр цілого числа `n`. Програма має враховувати, що на вхід може подаватися ціле від’ємне число.

n = input("Введіть число")
sum = 0
for i in n:
    if i != "-":
      sum += int(i)
print(sum)

# 16. Напишіть програму для отримання рядка Фібоначчі від 0 до `n`, де `n` - ціле число.  
# *Послідовність Фібоначчі - це серія чисел 0, 1, 1, 2, 3, 5, 8, 13, 21, .... Кожне наступне число знайдено шляхом додавання двох номерів перед ним.*

n = int(input("Введіть ціле число: "))
list_fib = [0, 1]
if n == 0:
  list_fib = [0]
else:
  while (list_fib[-1] + list_fib[-2]) <= n:
     list_fib.append(list_fib[-1] + list_fib[-2])
print(list_fib)


# 17. За введеним користувачем цілим числом n визначте n-е число Фібоначчі.

n = int(input("Введіть ціле число: "))
list_fib = [0, 1]
if n == 0:
  print(list_fib[0])
else:
  for i in range(n - 1):
    list_fib.append(list_fib[-1] + list_fib[-2])
  print(list_fib[-1])
