
# *Beginner level*
# 1. Напишіть програму, яка приймає від користувача рядок, і відображає цей рядок у верхньому і нижньому регістрах.

s = input("Please enter a string: ")
print(s.upper(), s.lower())

#2. Скласти програму, яка запитує назву баскетбольної команди і повторює її на екрані зі словами: This is a champion!.

s = input("Please enter the name of the team: ")
print(f"{s} - this is a champion!")

# 3. Дано натуральне число. Знайти число, що отримується при прочитанні його цифр справа наліво.

n = 2345
print(int(str(n)[::-1]))

# 4. Дано рядок. Змініть регістр символів в цьому рядку так, щоб перша буква кожного слова була великою, а інші літери - малими. (метод 's.title()')

s = "Hello world!"
print((s.title()))

# 5. Дано рядок. Визначити порядковий номер першої вказаної букви. Якщо такої літери немає, вивести нуль.

s = "Hello world!"
if s.lower().find("r") != -1:
    print(s.lower().find("r") + 1)
else:
    print("0")

# *Middle level*

# 6. Напишіть програму, яка по введеному числу `n` від 1 до 9 виводить на екран `n` пінгвінів з відповідним номером - число від 1 до `n`. Зображення одного пінгвіна має розмір `5 x 9` символів, між двома сусідніми пінгвінами також є порожній (з пропусків) стовпець. Дозволяється вивести порожній стовпець після останнього пінгвіна. Для спрощення малювання скопіюйте пінгвіна із вихідних даних. Врахуйте, що виведення на екран виконується порядково, а не «попінгвінно».

n = int(input("Please enter a number from 1 to 9: "))
print("   _~_     " * n)
print("  (o o)    " * n)
print(" /  V  \   " * n)
for i in range(n):
  print(f"/(  {i + 1}  )\  ",end="")
print(end="\n")
for i in range(n):
  print("  ^^ ^^    ",end="")

#  7. У рядку є кілька слів, розділених одним або декількома пропусками. Потрібно прибрати з тексту зайві пропуски: два і більше пропусків поспіль, а також всі пропуски на початку і в кінці рядка. На вхід програмі подається рядок, що складається не більше ніж з 255 символів. Надрукувати новий рядок.

s = "Beyond the green     swelling hills of the     Mittel Land rose mighty slopes of forest    up    to the lofty steeps of the Carpathians    themselves"
new_s = []

if len(s) <= 254:
   for i in s.split(" "):
      new_s.append(i.strip())
   new_s = [ k for k in new_s if k ]
   print(" ".join(new_s ))

# *Hard level*

# 8. Дано рядок, що складається з `n` цифр (тобто одноцифрових чисел), між якими стоїть `n-1` знаків операцій, кожна з яких може бути або `+`, або `-`. Обчисліть значення цього виразу. Програма має надрукувати результат обчислення цього виразу.

s = "6+3-2"
result = int(s[0])
for i in range(len(s)):
    if s[i] == "+":
      result += int(s[i+1])
    elif s[i] == "-":
       result -= int(s[i+1])
print(result)

# 9. Напишіть програму, на вхід якої даються чотири числа `a`, `b`, `c` і `d`, кожне у своєму рядку. Програма повинна вивести фрагмент таблиці множення для всіх чисел відрізка `[a; b]` на всі числа відрізка `[c; d]`. Числа `a`, `b`, `c` і `d` є натуральними і не перевищують 10, a ≤ b, c ≤ d. Дотримуйтесь формату виведення як у вихідних даних. Для поділу елементів всередині рядка використовуйте `\t` - символ табуляції. Зауважте, що лівим стовпчиком і верхнім рядком виводяться самі числа із заданих відрізків.

a = 1
b = 4
c = 2
d = 5

if a <= b and c <= d:
  for i1 in range(c, d + 1):
    print(f"\t{i1}", end = "")
  print( end = "\n")
  print( end = "\n")
  for i1 in range(a, b + 1):
    print( i1, end = "")
    for i2 in range(c, d + 1):
      print(f"\t{i1 * i2}", end = "")
    print( end = "\n")
    print( end = "\n")

# 10. Напишіть програму для друку літери `A` за допомогою введеного користувачем символа.
   
symbol = input("Enter symbol: ")
print(f" {symbol*3} ")
print( end = "\n")
print(f"{symbol}   {symbol}")
print( end = "\n")
print(f"{symbol}   {symbol}")
print( end = "\n")
print(f"{symbol * 5}")
print( end = "\n")
print(f"{symbol}   {symbol}")
print( end = "\n")
print(f"{symbol}   {symbol}")
print( end = "\n")
print(f"{symbol}   {symbol}")

# 11. Напишіть програму, яка визначає, чи є у введеному рядку десяткові цифри, і виводить найбільше число, яке можна скласти з цих цифр. Провідних нулів у числі бути не повинно (за винятком числа 0, запис якого містить рівно одну цифру). Гарантовано, що у рядку є принаймні одна цифра. Вхідний рядок містить довільні символи. Програма повинна вивести найбільше число, яке можна скласти з присутніх в рядку десяткових цифр.

s = "Last Updated: February 22, 2018"
s = s.replace(" ","")
list_from_s = [k for k in s if k.isdigit()]
list_from_s.sort(reverse=True)
print("".join(list_from_s))
